kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_fdcan.h
/****************************************************************************
 * arch/arm/src/stm32h7/hardware/stm32_fdcan.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32_FDCAN_H
#define __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32_FDCAN_H

/* **************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "chip.h"

/* **************************************************************************
 *                                                                          *
 *                Flexible Datarate Controller Area Network                 *
 *                                                                          *
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_FDCAN_CREL_OFFSET       0x0000  /* FDCAN Core Release register */
#define STM32_FDCAN_ENDN_OFFSET       0x0004  /* FDCAN Endian register */
#define STM32_FDCAN_DBTP_OFFSET       0x000C  /* FDCAN Data Bit Timing & Prescaler register */
#define STM32_FDCAN_TEST_OFFSET       0x0010  /* FDCAN Test register */
#define STM32_FDCAN_RWD_OFFSET        0x0014  /* FDCAN RAM Watchdog register */
#define STM32_FDCAN_CCCR_OFFSET       0x0018  /* FDCAN CC Control register */
#define STM32_FDCAN_NBTP_OFFSET       0x001C  /* FDCAN Nominal Bit Timing & Prescaler register */
#define STM32_FDCAN_TSCC_OFFSET       0x0020  /* FDCAN Timestamp Counter Configuration register */
#define STM32_FDCAN_TSCV_OFFSET       0x0024  /* FDCAN Timestamp Counter Value register */
#define STM32_FDCAN_TOCC_OFFSET       0x0028  /* FDCAN Timeout Counter Configuration register */
#define STM32_FDCAN_TOCV_OFFSET       0x002C  /* FDCAN Timeout Counter Value register */
#define STM32_FDCAN_ECR_OFFSET        0x0040  /* FDCAN Error Counter register */
#define STM32_FDCAN_PSR_OFFSET        0x0044  /* FDCAN Protocol Status register */
#define STM32_FDCAN_TDCR_OFFSET       0x0048  /* FDCAN Transmitter Delay Compensation register */
#define STM32_FDCAN_IR_OFFSET         0x0050  /* FDCAN Interrupt register */
#define STM32_FDCAN_IE_OFFSET         0x0054  /* FDCAN Interrupt Enable register */
#define STM32_FDCAN_ILS_OFFSET        0x0058  /* FDCAN Interrupt Line Select register */
#define STM32_FDCAN_ILE_OFFSET        0x005C  /* FDCAN Interrupt Line Enable register */
#define STM32_FDCAN_RXGFC_OFFSET      0x0080  /* FDCAN Global Filter Configuration register */
#define STM32_FDCAN_XIDAM_OFFSET      0x0084  /* FDCAN Extended ID AND Mask register */
#define STM32_FDCAN_HPMS_OFFSET       0x0088  /* FDCAN High Priority Message Status register */
#define STM32_FDCAN_RXF0S_OFFSET      0x0090  /* FDCAN Rx FIFO 0 Status register */
#define STM32_FDCAN_RXF0A_OFFSET      0x0094  /* FDCAN Rx FIFO 0 Acknowledge register */
#define STM32_FDCAN_RXF1S_OFFSET      0x0098  /* FDCAN Rx FIFO 1 Status register */
#define STM32_FDCAN_RXF1A_OFFSET      0x009C  /* FDCAN Rx FIFO 1 Acknowledge register */
#define STM32_FDCAN_TXBC_OFFSET       0x00C0  /* FDCAN Tx Buffer Configuration register */
#define STM32_FDCAN_TXFQS_OFFSET      0x00C4  /* FDCAN Tx FIFO/Queue Status register */
#define STM32_FDCAN_TXBRP_OFFSET      0x00C8  /* FDCAN Tx Buffer Request Pending register */
#define STM32_FDCAN_TXBAR_OFFSET      0x00CC  /* FDCAN Tx Buffer Add Request register */
#define STM32_FDCAN_TXBCR_OFFSET      0x00D0  /* FDCAN Tx Buffer Cancellation Request register */
#define STM32_FDCAN_TXBTO_OFFSET      0x00D4  /* FDCAN Tx Buffer Transmission Occurred register */
#define STM32_FDCAN_TXBCF_OFFSET      0x00D8  /* FDCAN Tx Buffer Cancellation Finished register */
#define STM32_FDCAN_TXBTIE_OFFSET     0x00DC  /* FDCAN Tx Buffer Transmission Interrupt Enable register */
#define STM32_FDCAN_TXBCIE_OFFSET     0x00E0  /* FDCAN Tx Buffer Cancellation Finished Interrupt Enable register */
#define STM32_FDCAN_TXEFS_OFFSET      0x00E4  /* FDCAN Tx Event FIFO Status register */
#define STM32_FDCAN_TXEFA_OFFSET      0x00E8  /* FDCAN Tx Event FIFO Acknowledge register */
#define STM32_FDCAN_CKDIV_OFFSET     0x0100  /* FDCAN Global Filter Configuration register */

/* Register Addresses *******************************************************/

#define STM32_FDCAN1_CREL       (STM32_FDCAN1_BASE + STM32_FDCAN_CREL_OFFSET)
#define STM32_FDCAN1_ENDN       (STM32_FDCAN1_BASE + STM32_FDCAN_ENDN_OFFSET)
#define STM32_FDCAN1_DBTP       (STM32_FDCAN1_BASE + STM32_FDCAN_DBTP_OFFSET)
#define STM32_FDCAN1_TEST       (STM32_FDCAN1_BASE + STM32_FDCAN_TEST_OFFSET)
#define STM32_FDCAN1_RWD        (STM32_FDCAN1_BASE + STM32_FDCAN_RWD_OFFSET)
#define STM32_FDCAN1_CCCR       (STM32_FDCAN1_BASE + STM32_FDCAN_CCCR_OFFSET)
#define STM32_FDCAN1_NBTP       (STM32_FDCAN1_BASE + STM32_FDCAN_NBTP_OFFSET)
#define STM32_FDCAN1_TSCC       (STM32_FDCAN1_BASE + STM32_FDCAN_TSCC_OFFSET)
#define STM32_FDCAN1_TSCV       (STM32_FDCAN1_BASE + STM32_FDCAN_TSCV_OFFSET)
#define STM32_FDCAN1_TOCC       (STM32_FDCAN1_BASE + STM32_FDCAN_TOCC_OFFSET)
#define STM32_FDCAN1_TOCV       (STM32_FDCAN1_BASE + STM32_FDCAN_TOCV_OFFSET)
#define STM32_FDCAN1_ECR        (STM32_FDCAN1_BASE + STM32_FDCAN_ECR_OFFSET)
#define STM32_FDCAN1_PSR        (STM32_FDCAN1_BASE + STM32_FDCAN_PSR_OFFSET)
#define STM32_FDCAN1_TDCR       (STM32_FDCAN1_BASE + STM32_FDCAN_TDCR_OFFSET)
#define STM32_FDCAN1_IR         (STM32_FDCAN1_BASE + STM32_FDCAN_IR_OFFSET)
#define STM32_FDCAN1_IE         (STM32_FDCAN1_BASE + STM32_FDCAN_IE_OFFSET)
#define STM32_FDCAN1_ILS        (STM32_FDCAN1_BASE + STM32_FDCAN_ILS_OFFSET)
#define STM32_FDCAN1_ILE        (STM32_FDCAN1_BASE + STM32_FDCAN_ILE_OFFSET)
#define STM32_FDCAN1_RXGFC      (STM32_FDCAN1_BASE + STM32_FDCAN_RXGFC_OFFSET)
#define STM32_FDCAN1_XIDAM      (STM32_FDCAN1_BASE + STM32_FDCAN_XIDAM_OFFSET)
#define STM32_FDCAN1_HPMS       (STM32_FDCAN1_BASE + STM32_FDCAN_HPMS_OFFSET)
#define STM32_FDCAN1_RXF0S      (STM32_FDCAN1_BASE + STM32_FDCAN_RXF0S_OFFSET)
#define STM32_FDCAN1_RXF0A      (STM32_FDCAN1_BASE + STM32_FDCAN_RXF0A_OFFSET)
#define STM32_FDCAN1_RXF1S      (STM32_FDCAN1_BASE + STM32_FDCAN_RXF1S_OFFSET)
#define STM32_FDCAN1_RXF1A      (STM32_FDCAN1_BASE + STM32_FDCAN_RXF1A_OFFSET)
#define STM32_FDCAN1_TXBC       (STM32_FDCAN1_BASE + STM32_FDCAN_TXBC_OFFSET)
#define STM32_FDCAN1_TXFQS      (STM32_FDCAN1_BASE + STM32_FDCAN_TXFQS_OFFSET)
#define STM32_FDCAN1_TXBRP      (STM32_FDCAN1_BASE + STM32_FDCAN_TXBRP_OFFSET)
#define STM32_FDCAN1_TXBAR      (STM32_FDCAN1_BASE + STM32_FDCAN_TXBAR_OFFSET)
#define STM32_FDCAN1_TXBCR      (STM32_FDCAN1_BASE + STM32_FDCAN_TXBCR_OFFSET)
#define STM32_FDCAN1_TXBTO      (STM32_FDCAN1_BASE + STM32_FDCAN_TXBTO_OFFSET)
#define STM32_FDCAN1_TXBCF      (STM32_FDCAN1_BASE + STM32_FDCAN_TXBCF_OFFSET)
#define STM32_FDCAN1_TXBTIE     (STM32_FDCAN1_BASE + STM32_FDCAN_TXBTIE_OFFSET)
#define STM32_FDCAN1_TXBCIE     (STM32_FDCAN1_BASE + STM32_FDCAN_TXBCIE_OFFSET)
#define STM32_FDCAN1_TXEFS      (STM32_FDCAN1_BASE + STM32_FDCAN_TXEFS_OFFSET)
#define STM32_FDCAN1_TXEFA      (STM32_FDCAN1_BASE + STM32_FDCAN_TXEFA_OFFSET)

#define STM32_FDCAN2_CREL       (STM32_FDCAN2_BASE + STM32_FDCAN_CREL_OFFSET)
#define STM32_FDCAN2_ENDN       (STM32_FDCAN2_BASE + STM32_FDCAN_ENDN_OFFSET)
#define STM32_FDCAN2_DBTP       (STM32_FDCAN2_BASE + STM32_FDCAN_DBTP_OFFSET)
#define STM32_FDCAN2_TEST       (STM32_FDCAN2_BASE + STM32_FDCAN_TEST_OFFSET)
#define STM32_FDCAN2_RWD        (STM32_FDCAN2_BASE + STM32_FDCAN_RWD_OFFSET)
#define STM32_FDCAN2_CCCR       (STM32_FDCAN2_BASE + STM32_FDCAN_CCCR_OFFSET)
#define STM32_FDCAN2_NBTP       (STM32_FDCAN2_BASE + STM32_FDCAN_NBTP_OFFSET)
#define STM32_FDCAN2_TSCC       (STM32_FDCAN2_BASE + STM32_FDCAN_TSCC_OFFSET)
#define STM32_FDCAN2_TSCV       (STM32_FDCAN2_BASE + STM32_FDCAN_TSCV_OFFSET)
#define STM32_FDCAN2_TOCC       (STM32_FDCAN2_BASE + STM32_FDCAN_TOCC_OFFSET)
#define STM32_FDCAN2_TOCV       (STM32_FDCAN2_BASE + STM32_FDCAN_TOCV_OFFSET)
#define STM32_FDCAN2_ECR        (STM32_FDCAN2_BASE + STM32_FDCAN_ECR_OFFSET)
#define STM32_FDCAN2_PSR        (STM32_FDCAN2_BASE + STM32_FDCAN_PSR_OFFSET)
#define STM32_FDCAN2_TDCR       (STM32_FDCAN2_BASE + STM32_FDCAN_TDCR_OFFSET)
#define STM32_FDCAN2_IR         (STM32_FDCAN2_BASE + STM32_FDCAN_IR_OFFSET)
#define STM32_FDCAN2_IE         (STM32_FDCAN2_BASE + STM32_FDCAN_IE_OFFSET)
#define STM32_FDCAN2_ILS        (STM32_FDCAN2_BASE + STM32_FDCAN_ILS_OFFSET)
#define STM32_FDCAN2_ILE        (STM32_FDCAN2_BASE + STM32_FDCAN_ILE_OFFSET)
#define STM32_FDCAN2_RXGFC      (STM32_FDCAN2_BASE + STM32_FDCAN_RXGFC_OFFSET)
#define STM32_FDCAN2_SIDFC      (STM32_FDCAN2_BASE + STM32_FDCAN_SIDFC_OFFSET)
#define STM32_FDCAN2_XIDFC      (STM32_FDCAN2_BASE + STM32_FDCAN_XIDFC_OFFSET)
#define STM32_FDCAN2_XIDAM      (STM32_FDCAN2_BASE + STM32_FDCAN_XIDAM_OFFSET)
#define STM32_FDCAN2_HPMS       (STM32_FDCAN2_BASE + STM32_FDCAN_HPMS_OFFSET)
#define STM32_FDCAN2_RXF0S      (STM32_FDCAN2_BASE + STM32_FDCAN_RXF0S_OFFSET)
#define STM32_FDCAN2_RXF0A      (STM32_FDCAN2_BASE + STM32_FDCAN_RXF0A_OFFSET)
#define STM32_FDCAN2_RXF1S      (STM32_FDCAN2_BASE + STM32_FDCAN_RXF1S_OFFSET)
#define STM32_FDCAN2_RXF1A      (STM32_FDCAN2_BASE + STM32_FDCAN_RXF1A_OFFSET)
#define STM32_FDCAN2_TXBC       (STM32_FDCAN2_BASE + STM32_FDCAN_TXBC_OFFSET)
#define STM32_FDCAN2_TXFQS      (STM32_FDCAN2_BASE + STM32_FDCAN_TXFQS_OFFSET)
#define STM32_FDCAN2_TXBRP      (STM32_FDCAN2_BASE + STM32_FDCAN_TXBRP_OFFSET)
#define STM32_FDCAN2_TXBAR      (STM32_FDCAN2_BASE + STM32_FDCAN_TXBAR_OFFSET)
#define STM32_FDCAN2_TXBCR      (STM32_FDCAN2_BASE + STM32_FDCAN_TXBCR_OFFSET)
#define STM32_FDCAN2_TXBTO      (STM32_FDCAN2_BASE + STM32_FDCAN_TXBTO_OFFSET)
#define STM32_FDCAN2_TXBCF      (STM32_FDCAN2_BASE + STM32_FDCAN_TXBCF_OFFSET)
#define STM32_FDCAN2_TXBTIE     (STM32_FDCAN2_BASE + STM32_FDCAN_TXBTIE_OFFSET)
#define STM32_FDCAN2_TXBCIE     (STM32_FDCAN2_BASE + STM32_FDCAN_TXBCIE_OFFSET)
#define STM32_FDCAN2_TXEFS      (STM32_FDCAN2_BASE + STM32_FDCAN_TXEFS_OFFSET)
#define STM32_FDCAN2_TXEFA      (STM32_FDCAN2_BASE + STM32_FDCAN_TXEFA_OFFSET)

/* FDCAN control and status registers */
#define FDCAN_CREL_DAY_SHIFT      (0U)
#define FDCAN_CREL_DAY_MASK       (0xFFU << FDCAN_CREL_DAY_SHIFT)               /* 0x000000FF */
#define FDCAN_CREL_DAY            FDCAN_CREL_DAY_MASK                           /* Timestamp Day                           */
#define FDCAN_CREL_MON_SHIFT      (8U)
#define FDCAN_CREL_MON_MASK       (0xFFU << FDCAN_CREL_MON_SHIFT)               /* 0x0000FF00 */
#define FDCAN_CREL_MON            FDCAN_CREL_MON_MASK                           /* Timestamp Month                         */
#define FDCAN_CREL_YEAR_SHIFT     (16U)
#define FDCAN_CREL_YEAR_MASK      (0xFU << FDCAN_CREL_YEAR_SHIFT)               /* 0x000F0000 */
#define FDCAN_CREL_YEAR           FDCAN_CREL_YEAR_MASK                          /* Timestamp Year                          */
#define FDCAN_CREL_SUBSTEP_SHIFT  (20U)
#define FDCAN_CREL_SUBSTEP_MASK   (0xFU << FDCAN_CREL_SUBSTEP_SHIFT)            /* 0x00F00000 */
#define FDCAN_CREL_SUBSTEP        FDCAN_CREL_SUBSTEP_MASK                       /* Sub-step of Core release                */
#define FDCAN_CREL_STEP_SHIFT     (24U)
#define FDCAN_CREL_STEP_MASK      (0xFU << FDCAN_CREL_STEP_SHIFT)               /* 0x0F000000 */
#define FDCAN_CREL_STEP           FDCAN_CREL_STEP_MASK                          /* Step of Core release                    */
#define FDCAN_CREL_REL_SHIFT      (28U)
#define FDCAN_CREL_REL_MASK       (0xFU << FDCAN_CREL_REL_SHIFT)                /* 0xF0000000 */
#define FDCAN_CREL_REL            FDCAN_CREL_REL_MASK                           /* Core release                            */

/* ***************  Bit definition for FDCAN_ENDN register  *****************/
#define FDCAN_ENDN_ETV_SHIFT      (0U)
#define FDCAN_ENDN_ETV_MASK       (0xFFFFFFFFU << FDCAN_ENDN_ETV_SHIFT)         /* 0xFFFFFFFF */
#define FDCAN_ENDN_ETV            FDCAN_ENDN_ETV_MASK                           /* Endiannes Test Value                    */

/* ***************  Bit definition for FDCAN_DBTP register  *****************/
#define FDCAN_DBTP_DSJW_SHIFT     (0U)
#define FDCAN_DBTP_DSJW_MASK      (0xFU << FDCAN_DBTP_DSJW_SHIFT)               /* 0x0000000F */
#define FDCAN_DBTP_DSJW           FDCAN_DBTP_DSJW_MASK                          /* Synchronization Jump Width              */
#define FDCAN_DBTP_DTSEG2_SHIFT   (4U)
#define FDCAN_DBTP_DTSEG2_MASK    (0xFU << FDCAN_DBTP_DTSEG2_SHIFT)             /* 0x000000F0 */
#define FDCAN_DBTP_DTSEG2         FDCAN_DBTP_DTSEG2_MASK                        /* Data time segment after sample point    */
#define FDCAN_DBTP_DTSEG1_SHIFT   (8U)
#define FDCAN_DBTP_DTSEG1_MASK    (0xFU << FDCAN_DBTP_DTSEG1_SHIFT)             /* 0x00000F00 */
#define FDCAN_DBTP_DTSEG1         FDCAN_DBTP_DTSEG1_MASK                        /* Data time segment before sample point   */
#define FDCAN_DBTP_DBRP_SHIFT     (16U)
#define FDCAN_DBTP_DBRP_MASK      (0x1FU << FDCAN_DBTP_DBRP_SHIFT)              /* 0x001F0000 */
#define FDCAN_DBTP_DBRP           FDCAN_DBTP_DBRP_MASK                          /* Data BIt Rate Prescaler                 */
#define FDCAN_DBTP_TDC_SHIFT      (23U)
#define FDCAN_DBTP_TDC_MASK       (0x1U << FDCAN_DBTP_TDC_SHIFT)                /* 0x00800000 */
#define FDCAN_DBTP_TDC            FDCAN_DBTP_TDC_MASK                           /* Transceiver Delay Compensation          */

/* ***************  Bit definition for FDCAN_TEST register  *****************/
#define FDCAN_TEST_LBCK_SHIFT     (4U)
#define FDCAN_TEST_LBCK_MASK      (0x1U << FDCAN_TEST_LBCK_SHIFT)               /* 0x00000010 */
#define FDCAN_TEST_LBCK           FDCAN_TEST_LBCK_MASK                          /* Loop Back mode                           */
#define FDCAN_TEST_TX_SHIFT       (5U)
#define FDCAN_TEST_TX_MASK        (0x3U << FDCAN_TEST_TX_SHIFT)                 /* 0x00000060 */
#define FDCAN_TEST_TX             FDCAN_TEST_TX_MASK                            /* Control of Transmit Pin                  */
#define FDCAN_TEST_RX_SHIFT       (7U)
#define FDCAN_TEST_RX_MASK        (0x1U << FDCAN_TEST_RX_SHIFT)                 /* 0x00000080 */
#define FDCAN_TEST_RX             FDCAN_TEST_RX_MASK                            /* Receive Pin                              */

/* ***************  Bit definition for FDCAN_RWD register  ******************/
#define FDCAN_RWD_WDC_SHIFT       (0U)
#define FDCAN_RWD_WDC_MASK        (0xFU << FDCAN_RWD_WDC_SHIFT)                 /* 0x0000000F */
#define FDCAN_RWD_WDC             FDCAN_RWD_WDC_MASK                            /* Watchdog configuration                   */
#define FDCAN_RWD_WDV_SHIFT       (4U)
#define FDCAN_RWD_WDV_MASK        (0xFU << FDCAN_RWD_WDV_SHIFT)                 /* 0x000000F0 */
#define FDCAN_RWD_WDV             FDCAN_RWD_WDV_MASK                            /* Watchdog value                           */

/* ***************  Bit definition for FDCAN_CCCR register  *****************/
#define FDCAN_CCCR_INIT_SHIFT     (0U)
#define FDCAN_CCCR_INIT_MASK      (0x1U << FDCAN_CCCR_INIT_SHIFT)               /* 0x00000001 */
#define FDCAN_CCCR_INIT           FDCAN_CCCR_INIT_MASK                          /* Initialization                           */
#define FDCAN_CCCR_CCE_SHIFT      (1U)
#define FDCAN_CCCR_CCE_MASK       (0x1U << FDCAN_CCCR_CCE_SHIFT)                /* 0x00000002 */
#define FDCAN_CCCR_CCE            FDCAN_CCCR_CCE_MASK                           /* Configuration Change Enable              */
#define FDCAN_CCCR_ASM_SHIFT      (2U)
#define FDCAN_CCCR_ASM_MASK       (0x1U << FDCAN_CCCR_ASM_SHIFT)                /* 0x00000004 */
#define FDCAN_CCCR_ASM            FDCAN_CCCR_ASM_MASK                           /* ASM Restricted Operation Mode            */
#define FDCAN_CCCR_CSA_SHIFT      (3U)
#define FDCAN_CCCR_CSA_MASK       (0x1U << FDCAN_CCCR_CSA_SHIFT)                /* 0x00000008 */
#define FDCAN_CCCR_CSA            FDCAN_CCCR_CSA_MASK                           /* Clock Stop Acknowledge                   */
#define FDCAN_CCCR_CSR_SHIFT      (4U)
#define FDCAN_CCCR_CSR_MASK       (0x1U << FDCAN_CCCR_CSR_SHIFT)                /* 0x00000010 */
#define FDCAN_CCCR_CSR            FDCAN_CCCR_CSR_MASK                           /* Clock Stop Request                       */
#define FDCAN_CCCR_MON_SHIFT      (5U)
#define FDCAN_CCCR_MON_MASK       (0x1U << FDCAN_CCCR_MON_SHIFT)                /* 0x00000020 */
#define FDCAN_CCCR_MON            FDCAN_CCCR_MON_MASK                           /* Bus Monitoring Mode                      */
#define FDCAN_CCCR_DAR_SHIFT      (6U)
#define FDCAN_CCCR_DAR_MASK       (0x1U << FDCAN_CCCR_DAR_SHIFT)                /* 0x00000040 */
#define FDCAN_CCCR_DAR            FDCAN_CCCR_DAR_MASK                           /* Disable Automatic Retransmission         */
#define FDCAN_CCCR_TEST_SHIFT     (7U)
#define FDCAN_CCCR_TEST_MASK      (0x1U << FDCAN_CCCR_TEST_SHIFT)               /* 0x00000080 */
#define FDCAN_CCCR_TEST           FDCAN_CCCR_TEST_MASK                          /* Test Mode Enable                         */
#define FDCAN_CCCR_FDOE_SHIFT     (8U)
#define FDCAN_CCCR_FDOE_MASK      (0x1U << FDCAN_CCCR_FDOE_SHIFT)               /* 0x00000100 */
#define FDCAN_CCCR_FDOE           FDCAN_CCCR_FDOE_MASK                          /* FD Operation Enable                      */
#define FDCAN_CCCR_BRSE_SHIFT     (9U)
#define FDCAN_CCCR_BRSE_MASK      (0x1U << FDCAN_CCCR_BRSE_SHIFT)               /* 0x00000200 */
#define FDCAN_CCCR_BRSE           FDCAN_CCCR_BRSE_MASK                          /* FDCAN Bit Rate Switching                 */
#define FDCAN_CCCR_PXHD_SHIFT     (12U)
#define FDCAN_CCCR_PXHD_MASK      (0x1U << FDCAN_CCCR_PXHD_SHIFT)               /* 0x00001000 */
#define FDCAN_CCCR_PXHD           FDCAN_CCCR_PXHD_MASK                          /* Protocol Exception Handling Disable      */
#define FDCAN_CCCR_EFBI_SHIFT     (13U)
#define FDCAN_CCCR_EFBI_MASK      (0x1U << FDCAN_CCCR_EFBI_SHIFT)               /* 0x00002000 */
#define FDCAN_CCCR_EFBI           FDCAN_CCCR_EFBI_MASK                          /* Edge Filtering during Bus Integration    */
#define FDCAN_CCCR_TXP_SHIFT      (14U)
#define FDCAN_CCCR_TXP_MASK       (0x1U << FDCAN_CCCR_TXP_SHIFT)                /* 0x00004000 */
#define FDCAN_CCCR_TXP            FDCAN_CCCR_TXP_MASK                           /* Two CAN bit times Pause                  */
#define FDCAN_CCCR_NISO_SHIFT     (15U)
#define FDCAN_CCCR_NISO_MASK      (0x1U << FDCAN_CCCR_NISO_SHIFT)               /* 0x00008000 */
#define FDCAN_CCCR_NISO           FDCAN_CCCR_NISO_MASK                          /* Non ISO Operation                        */

