kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_fdcan.h
/* ***************  Bit definition for FDCAN_NBTP register  *****************/
#define FDCAN_NBTP_TSEG2_SHIFT    (0U)
#define FDCAN_NBTP_TSEG2_MASK     (0x7FU << FDCAN_NBTP_TSEG2_SHIFT)             /* 0x0000007F */
#define FDCAN_NBTP_TSEG2          FDCAN_NBTP_TSEG2_MASK                         /* Nominal Time segment after sample point  */
#define FDCAN_NBTP_NTSEG1_SHIFT   (8U)
#define FDCAN_NBTP_NTSEG1_MASK    (0xFFU << FDCAN_NBTP_NTSEG1_SHIFT)            /* 0x0000FF00 */
#define FDCAN_NBTP_NTSEG1         FDCAN_NBTP_NTSEG1_MASK                        /* Nominal Time segment before sample point */
#define FDCAN_NBTP_NBRP_SHIFT     (16U)
#define FDCAN_NBTP_NBRP_MASK      (0x1FFU << FDCAN_NBTP_NBRP_SHIFT)             /* 0x01FF0000 */
#define FDCAN_NBTP_NBRP           FDCAN_NBTP_NBRP_MASK                          /* Bit Rate Prescaler                       */
#define FDCAN_NBTP_NSJW_SHIFT     (25U)
#define FDCAN_NBTP_NSJW_MASK      (0x7FU << FDCAN_NBTP_NSJW_SHIFT)              /* 0xFE000000 */
#define FDCAN_NBTP_NSJW           FDCAN_NBTP_NSJW_MASK                          /* Nominal (Re)Synchronization Jump Width   */

/* ***************  Bit definition for FDCAN_TSCC register  *****************/
#define FDCAN_TSCC_TSS_SHIFT      (0U)
#define FDCAN_TSCC_TSS_MASK       (0x3U << FDCAN_TSCC_TSS_SHIFT)                /* 0x00000003 */
#define FDCAN_TSCC_TSS            FDCAN_TSCC_TSS_MASK                           /* Timestamp Select                         */
#define FDCAN_TSCC_TCP_SHIFT      (16U)
#define FDCAN_TSCC_TCP_MASK       (0xFU << FDCAN_TSCC_TCP_SHIFT)                /* 0x000F0000 */
#define FDCAN_TSCC_TCP            FDCAN_TSCC_TCP_MASK                           /* Timestamp Counter Prescaler              */

/* ***************  Bit definition for FDCAN_TSCV register  *****************/
#define FDCAN_TSCV_TSC_SHIFT      (0U)
#define FDCAN_TSCV_TSC_MASK       (0xFFFFU << FDCAN_TSCV_TSC_SHIFT)             /* 0x0000FFFF */
#define FDCAN_TSCV_TSC            FDCAN_TSCV_TSC_MASK                           /* Timestamp Counter                        */

/* ***************  Bit definition for FDCAN_TOCC register  *****************/
#define FDCAN_TOCC_ETOC_SHIFT     (0U)
#define FDCAN_TOCC_ETOC_MASK      (0x1U << FDCAN_TOCC_ETOC_SHIFT)               /* 0x00000001 */
#define FDCAN_TOCC_ETOC           FDCAN_TOCC_ETOC_MASK                          /* Enable Timeout Counter                   */
#define FDCAN_TOCC_TOS_SHIFT      (1U)
#define FDCAN_TOCC_TOS_MASK       (0x3U << FDCAN_TOCC_TOS_SHIFT)                /* 0x00000006 */
#define FDCAN_TOCC_TOS            FDCAN_TOCC_TOS_MASK                           /* Timeout Select                           */
#define FDCAN_TOCC_TOP_SHIFT      (16U)
#define FDCAN_TOCC_TOP_MASK       (0xFFFFU << FDCAN_TOCC_TOP_SHIFT)             /* 0xFFFF0000 */
#define FDCAN_TOCC_TOP            FDCAN_TOCC_TOP_MASK                           /* Timeout Period                           */

/* ***************  Bit definition for FDCAN_TOCV register  *****************/
#define FDCAN_TOCV_TOC_SHIFT      (0U)
#define FDCAN_TOCV_TOC_MASK       (0xFFFFU << FDCAN_TOCV_TOC_SHIFT)             /* 0x0000FFFF */
#define FDCAN_TOCV_TOC            FDCAN_TOCV_TOC_MASK                           /* Timeout Counter                          */

/* ***************  Bit definition for FDCAN_ECR register  ******************/
#define FDCAN_ECR_TEC_SHIFT       (0U)
#define FDCAN_ECR_TEC_MASK        (0xFFU << FDCAN_ECR_TEC_SHIFT)                /* 0x0000000FF */
#define FDCAN_ECR_TEC             FDCAN_ECR_TEC_MASK                            /* Transmit Error Counter                   */
#define FDCAN_ECR_TREC_SHIFT      (8U)
#define FDCAN_ECR_TREC_MASK       (0x7FU << FDCAN_ECR_TREC_SHIFT)               /* 0x00007F00 */
#define FDCAN_ECR_TREC            FDCAN_ECR_TREC_MASK                           /* Receive Error Counter                    */
#define FDCAN_ECR_RP_SHIFT        (15U)
#define FDCAN_ECR_RP_MASK         (0x1U << FDCAN_ECR_RP_SHIFT)                  /* 0x00008000 */
#define FDCAN_ECR_RP              FDCAN_ECR_RP_MASK                             /* Receive Error Passive                    */
#define FDCAN_ECR_CEL_SHIFT       (16U)
#define FDCAN_ECR_CEL_MASK        (0xFFU << FDCAN_ECR_CEL_SHIFT)                /* 0x00FF0000 */
#define FDCAN_ECR_CEL             FDCAN_ECR_CEL_MASK                            /* CAN Error Logging                        */

/* Error codes */

#define FDCAN_PSR_EC_NO_ERROR       (0)                                    /* No error occurred since LEC has been reset */
#define FDCAN_PSR_EC_STUFF_ERROR    (1)                                    /* More than 5 equal bits in a sequence */
#define FDCAN_PSR_EC_FORM_ERROR     (2)                                    /* Part of a received frame has wrong format */
#define FDCAN_PSR_EC_ACK_ERROR      (3)                                    /* Message not acknowledged by another node */
#define FDCAN_PSR_EC_BIT1_ERROR     (4)                                    /* Send with recessive level, but bus value was dominant */
#define FDCAN_PSR_EC_BIT0_ERROR     (5)                                    /* Send with dominant level, but bus value was recessive */
#define FDCAN_PSR_EC_CRC_ERROR      (6)                                    /* CRC received message incorrect */
#define FDCAN_PSR_EC_NO_CHANGE      (7)                                    /* No CAN bus event was detected since last read */

/* ***************  Bit definition for FDCAN_PSR register  ******************/
#define FDCAN_PSR_LEC_SHIFT       (0U)
#define FDCAN_PSR_LEC_MASK        (0x7U << FDCAN_PSR_LEC_SHIFT)                 /* 0x00000007 */
#define FDCAN_PSR_LEC(n)          ((uint32_t)(n) << FDCAN_PSR_LEC_SHIFT)        /* See error codes above */
#define FDCAN_PSR_ACT_SHIFT       (3U)
#define FDCAN_PSR_ACT_MASK        (0x3U << FDCAN_PSR_ACT_SHIFT)                 /* 0x00000018 */
#define FDCAN_PSR_ACT             FDCAN_PSR_ACT_MASK                            /* Activity                                 */
#define FDCAN_PSR_EP_SHIFT        (5U)
#define FDCAN_PSR_EP_MASK         (0x1U << FDCAN_PSR_EP_SHIFT)                  /* 0x00000020 */
#define FDCAN_PSR_EP              FDCAN_PSR_EP_MASK                             /* Error Passive                            */
#define FDCAN_PSR_EW_SHIFT        (6U)
#define FDCAN_PSR_EW_MASK         (0x1U << FDCAN_PSR_EW_SHIFT)                  /* 0x00000040 */
#define FDCAN_PSR_EW              FDCAN_PSR_EW_MASK                             /* Warning Status                           */
#define FDCAN_PSR_BO_SHIFT        (7U)
#define FDCAN_PSR_BO_MASK         (0x1U << FDCAN_PSR_BO_SHIFT)                  /* 0x00000080 */
#define FDCAN_PSR_BO              FDCAN_PSR_BO_MASK                             /* Bus_Off Status                           */
#define FDCAN_PSR_DLEC_SHIFT      (8U)
#define FDCAN_PSR_DLEC_MASK       (0x7U << FDCAN_PSR_DLEC_SHIFT)                /* 0x00000700 */
#define FDCAN_PSR_DLEC(n)        ((uint32_t)(n) << FDCAN_PSR_DLEC_SHIFT)        /* See error codes above */
#define FDCAN_PSR_RESI_SHIFT      (11U)
#define FDCAN_PSR_RESI_MASK       (0x1U << FDCAN_PSR_RESI_SHIFT)                /* 0x00000800 */
#define FDCAN_PSR_RESI            FDCAN_PSR_RESI_MASK                           /* ESI flag of last received FDCAN Message  */
#define FDCAN_PSR_RBRS_SHIFT      (12U)
#define FDCAN_PSR_RBRS_MASK       (0x1U << FDCAN_PSR_RBRS_SHIFT)                /* 0x00001000 */
#define FDCAN_PSR_RBRS            FDCAN_PSR_RBRS_MASK                           /* BRS flag of last received FDCAN Message  */
#define FDCAN_PSR_REDL_SHIFT      (13U)
#define FDCAN_PSR_REDL_MASK       (0x1U << FDCAN_PSR_REDL_SHIFT)                /* 0x00002000 */
#define FDCAN_PSR_REDL            FDCAN_PSR_REDL_MASK                           /* Received FDCAN Message                   */
#define FDCAN_PSR_PXE_SHIFT       (14U)
#define FDCAN_PSR_PXE_MASK        (0x1U << FDCAN_PSR_PXE_SHIFT)                 /* 0x00004000 */
#define FDCAN_PSR_PXE             FDCAN_PSR_PXE_MASK                            /* Protocol Exception Event                 */
#define FDCAN_PSR_TDCV_SHIFT      (16U)
#define FDCAN_PSR_TDCV_MASK       (0x7FU << FDCAN_PSR_TDCV_SHIFT)               /* 0x007F0000 */
#define FDCAN_PSR_TDCV            FDCAN_PSR_TDCV_MASK                           /* Transmitter Delay Compensation Value     */

/* ***************  Bit definition for FDCAN_TDCR register  *****************/
#define FDCAN_TDCR_TDCF_SHIFT     (0U)
#define FDCAN_TDCR_TDCF_MASK      (0x7FU << FDCAN_TDCR_TDCF_SHIFT)              /* 0x0000007F */
#define FDCAN_TDCR_TDCF           FDCAN_TDCR_TDCF_MASK                          /* Transmitter Delay Compensation Filter    */
#define FDCAN_TDCR_TDCO_SHIFT     (8U)
#define FDCAN_TDCR_TDCO_MASK      (0x7FU << FDCAN_TDCR_TDCO_SHIFT)              /* 0x00007F00 */
#define FDCAN_TDCR_TDCO           FDCAN_TDCR_TDCO_MASK                          /* Transmitter Delay Compensation Offset    */

/* ***************  Bit definition for FDCAN_IR register  *******************/
#define FDCAN_IR_RF0N_SHIFT       (0U)
#define FDCAN_IR_RF0N_MASK        (0x1U << FDCAN_IR_RF0N_SHIFT)                 /* 0x00000001 */
#define FDCAN_IR_RF0N             FDCAN_IR_RF0N_MASK                            /* Rx FIFO 0 New Message                    */
#define FDCAN_IR_RF0W_SHIFT       (1U)
#define FDCAN_IR_RF0W_MASK        (0x1U << FDCAN_IR_RF0W_SHIFT)                 /* 0x00000002 */
#define FDCAN_IR_RF0W             FDCAN_IR_RF0W_MASK                            /* Rx FIFO 0 Watermark Reached              */
#define FDCAN_IR_RF0F_SHIFT       (2U)
#define FDCAN_IR_RF0F_MASK        (0x1U << FDCAN_IR_RF0F_SHIFT)                 /* 0x00000004 */
#define FDCAN_IR_RF0F             FDCAN_IR_RF0F_MASK                            /* Rx FIFO 0 Full                           */
#define FDCAN_IR_RF0L_SHIFT       (3U)
#define FDCAN_IR_RF0L_MASK        (0x1U << FDCAN_IR_RF0L_SHIFT)                 /* 0x00000008 */
#define FDCAN_IR_RF0L             FDCAN_IR_RF0L_MASK                            /* Rx FIFO 0 Message Lost                   */
#define FDCAN_IR_RF1N_SHIFT       (4U)
#define FDCAN_IR_RF1N_MASK        (0x1U << FDCAN_IR_RF1N_SHIFT)                 /* 0x00000010 */
#define FDCAN_IR_RF1N             FDCAN_IR_RF1N_MASK                            /* Rx FIFO 1 New Message                    */
#define FDCAN_IR_RF1W_SHIFT       (5U)
#define FDCAN_IR_RF1W_MASK        (0x1U << FDCAN_IR_RF1W_SHIFT)                 /* 0x00000020 */
#define FDCAN_IR_RF1W             FDCAN_IR_RF1W_MASK                            /* Rx FIFO 1 Watermark Reached              */
#define FDCAN_IR_RF1F_SHIFT       (6U)
#define FDCAN_IR_RF1F_MASK        (0x1U << FDCAN_IR_RF1F_SHIFT)                 /* 0x00000040 */
#define FDCAN_IR_RF1F             FDCAN_IR_RF1F_MASK                            /* Rx FIFO 1 Full                           */
#define FDCAN_IR_RF1L_SHIFT       (7U)
#define FDCAN_IR_RF1L_MASK        (0x1U << FDCAN_IR_RF1L_SHIFT)                 /* 0x00000080 */
#define FDCAN_IR_RF1L             FDCAN_IR_RF1L_MASK                            /* Rx FIFO 1 Message Lost                   */
#define FDCAN_IR_HPM_SHIFT        (8U)
#define FDCAN_IR_HPM_MASK         (0x1U << FDCAN_IR_HPM_SHIFT)                  /* 0x00000100 */
#define FDCAN_IR_HPM              FDCAN_IR_HPM_MASK                             /* High Priority Message                    */
#define FDCAN_IR_TC_SHIFT         (9U)
#define FDCAN_IR_TC_MASK          (0x1U << FDCAN_IR_TC_SHIFT)                   /* 0x00000200 */
#define FDCAN_IR_TC               FDCAN_IR_TC_MASK                              /* Transmission Completed                   */
#define FDCAN_IR_TCF_SHIFT        (10U)
#define FDCAN_IR_TCF_MASK         (0x1U << FDCAN_IR_TCF_SHIFT)                  /* 0x00000400 */
#define FDCAN_IR_TCF              FDCAN_IR_TCF_MASK                             /* Transmission Cancellation Finished       */
#define FDCAN_IR_TFE_SHIFT        (11U)
#define FDCAN_IR_TFE_MASK         (0x1U << FDCAN_IR_TFE_SHIFT)                  /* 0x00000800 */
#define FDCAN_IR_TFE              FDCAN_IR_TFE_MASK                             /* Tx FIFO Empty                            */
#define FDCAN_IR_TEFN_SHIFT       (12U)
#define FDCAN_IR_TEFN_MASK        (0x1U << FDCAN_IR_TEFN_SHIFT)                 /* 0x00001000 */
#define FDCAN_IR_TEFN             FDCAN_IR_TEFN_MASK                            /* Tx Event FIFO New Entry                  */
#define FDCAN_IR_TEFW_SHIFT       (13U)
#define FDCAN_IR_TEFW_MASK        (0x1U << FDCAN_IR_TEFW_SHIFT)                 /* 0x00002000 */
#define FDCAN_IR_TEFW             FDCAN_IR_TEFW_MASK                            /* Tx Event FIFO Watermark Reached          */
#define FDCAN_IR_TEFF_SHIFT       (14U)
#define FDCAN_IR_TEFF_MASK        (0x1U << FDCAN_IR_TEFF_SHIFT)                 /* 0x00004000 */
#define FDCAN_IR_TEFF             FDCAN_IR_TEFF_MASK                            /* Tx Event FIFO Full                       */
#define FDCAN_IR_TEFL_SHIFT       (15U)
#define FDCAN_IR_TEFL_MASK        (0x1U << FDCAN_IR_TEFL_SHIFT)                 /* 0x00008000 */
#define FDCAN_IR_TEFL             FDCAN_IR_TEFL_MASK                            /* Tx Event FIFO Element Lost               */
#define FDCAN_IR_TSW_SHIFT        (16U)
#define FDCAN_IR_TSW_MASK         (0x1U << FDCAN_IR_TSW_SHIFT)                  /* 0x00010000 */
#define FDCAN_IR_TSW              FDCAN_IR_TSW_MASK                             /* Timestamp Wraparound                     */
#define FDCAN_IR_MRAF_SHIFT       (17U)
#define FDCAN_IR_MRAF_MASK        (0x1U << FDCAN_IR_MRAF_SHIFT)                 /* 0x00020000 */
#define FDCAN_IR_MRAF             FDCAN_IR_MRAF_MASK                            /* Message RAM Access Failure               */
#define FDCAN_IR_TOO_SHIFT        (18U)
#define FDCAN_IR_TOO_MASK         (0x1U << FDCAN_IR_TOO_SHIFT)                  /* 0x00040000 */
#define FDCAN_IR_TOO              FDCAN_IR_TOO_MASK                             /* Timeout Occurred                         */
#define FDCAN_IR_DRX_SHIFT        (19U)
#define FDCAN_IR_DRX_MASK         (0x1U << FDCAN_IR_DRX_SHIFT)                  /* 0x00080000 */
#define FDCAN_IR_DRX              FDCAN_IR_DRX_MASK                             /* Message stored to Dedicated Rx Buffer    */
#define FDCAN_IR_ELO_SHIFT        (22U)
#define FDCAN_IR_ELO_MASK         (0x1U << FDCAN_IR_ELO_SHIFT)                  /* 0x00400000 */
#define FDCAN_IR_ELO              FDCAN_IR_ELO_MASK                             /* Error Logging Overflow                   */
#define FDCAN_IR_EP_SHIFT         (23U)
#define FDCAN_IR_EP_MASK          (0x1U << FDCAN_IR_EP_SHIFT)                   /* 0x00800000 */
#define FDCAN_IR_EP               FDCAN_IR_EP_MASK                              /* Error Passive                            */
#define FDCAN_IR_EW_SHIFT         (24U)
#define FDCAN_IR_EW_MASK          (0x1U << FDCAN_IR_EW_SHIFT)                   /* 0x01000000 */
#define FDCAN_IR_EW               FDCAN_IR_EW_MASK                              /* Warning Status                           */
#define FDCAN_IR_BO_SHIFT         (25U)
#define FDCAN_IR_BO_MASK          (0x1U << FDCAN_IR_BO_SHIFT)                   /* 0x02000000 */
#define FDCAN_IR_BO               FDCAN_IR_BO_MASK                              /* Bus_Off Status                           */
#define FDCAN_IR_WDI_SHIFT        (26U)
#define FDCAN_IR_WDI_MASK         (0x1U << FDCAN_IR_WDI_SHIFT)                  /* 0x04000000 */
#define FDCAN_IR_WDI              FDCAN_IR_WDI_MASK                             /* Watchdog Interrupt                       */
#define FDCAN_IR_PEA_SHIFT        (27U)
#define FDCAN_IR_PEA_MASK         (0x1U << FDCAN_IR_PEA_SHIFT)                  /* 0x08000000 */
#define FDCAN_IR_PEA              FDCAN_IR_PEA_MASK                             /* Protocol Error in Arbitration Phase      */
#define FDCAN_IR_PED_SHIFT        (28U)
#define FDCAN_IR_PED_MASK         (0x1U << FDCAN_IR_PED_SHIFT)                  /* 0x10000000 */
#define FDCAN_IR_PED              FDCAN_IR_PED_MASK                             /* Protocol Error in Data Phase             */
#define FDCAN_IR_ARA_SHIFT        (29U)
#define FDCAN_IR_ARA_MASK         (0x1U << FDCAN_IR_ARA_SHIFT)                  /* 0x20000000 */
#define FDCAN_IR_ARA              FDCAN_IR_ARA_MASK                             /* Access to Reserved Address               */

