kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_fdcan.h
/* ***************  Bit definition for FDCAN_IE register  *******************/
#define FDCAN_IE_RF0NE_SHIFT      (0U)
#define FDCAN_IE_RF0NE_MASK       (0x1U << FDCAN_IE_RF0NE_SHIFT)                /* 0x00000001 */
#define FDCAN_IE_RF0NE            FDCAN_IE_RF0NE_MASK                           /* Rx FIFO 0 New Message Enable                 */
#define FDCAN_IE_RF0WE_SHIFT      (1U)
#define FDCAN_IE_RF0WE_MASK       (0x1U << FDCAN_IE_RF0WE_SHIFT)                /* 0x00000002 */
#define FDCAN_IE_RF0WE            FDCAN_IE_RF0WE_MASK                           /* Rx FIFO 0 Watermark Reached Enable           */
#define FDCAN_IE_RF0FE_SHIFT      (2U)
#define FDCAN_IE_RF0FE_MASK       (0x1U << FDCAN_IE_RF0FE_SHIFT)                /* 0x00000004 */
#define FDCAN_IE_RF0FE            FDCAN_IE_RF0FE_MASK                           /* Rx FIFO 0 Full Enable                        */
#define FDCAN_IE_RF0LE_SHIFT      (3U)
#define FDCAN_IE_RF0LE_MASK       (0x1U << FDCAN_IE_RF0LE_SHIFT)                /* 0x00000008 */
#define FDCAN_IE_RF0LE            FDCAN_IE_RF0LE_MASK                           /* Rx FIFO 0 Message Lost Enable                */
#define FDCAN_IE_RF1NE_SHIFT      (4U)
#define FDCAN_IE_RF1NE_MASK       (0x1U << FDCAN_IE_RF1NE_SHIFT)                /* 0x00000010 */
#define FDCAN_IE_RF1NE            FDCAN_IE_RF1NE_MASK                           /* Rx FIFO 1 New Message Enable                 */
#define FDCAN_IE_RF1WE_SHIFT      (5U)
#define FDCAN_IE_RF1WE_MASK       (0x1U << FDCAN_IE_RF1WE_SHIFT)                /* 0x00000020 */
#define FDCAN_IE_RF1WE            FDCAN_IE_RF1WE_MASK                           /* Rx FIFO 1 Watermark Reached Enable           */
#define FDCAN_IE_RF1FE_SHIFT      (6U)
#define FDCAN_IE_RF1FE_MASK       (0x1U << FDCAN_IE_RF1FE_SHIFT)                /* 0x00000040 */
#define FDCAN_IE_RF1FE            FDCAN_IE_RF1FE_MASK                           /* Rx FIFO 1 Full Enable                        */
#define FDCAN_IE_RF1LE_SHIFT      (7U)
#define FDCAN_IE_RF1LE_MASK       (0x1U << FDCAN_IE_RF1LE_SHIFT)                /* 0x00000080 */
#define FDCAN_IE_RF1LE            FDCAN_IE_RF1LE_MASK                           /* Rx FIFO 1 Message Lost Enable                */
#define FDCAN_IE_HPME_SHIFT       (8U)
#define FDCAN_IE_HPME_MASK        (0x1U << FDCAN_IE_HPME_SHIFT)                 /* 0x00000100 */
#define FDCAN_IE_HPME             FDCAN_IE_HPME_MASK                            /* High Priority Message Enable                 */
#define FDCAN_IE_TCE_SHIFT        (9U)
#define FDCAN_IE_TCE_MASK         (0x1U << FDCAN_IE_TCE_SHIFT)                  /* 0x00000200 */
#define FDCAN_IE_TCE              FDCAN_IE_TCE_MASK                             /* Transmission Completed Enable                */
#define FDCAN_IE_TCFE_SHIFT       (10U)
#define FDCAN_IE_TCFE_MASK        (0x1U << FDCAN_IE_TCFE_SHIFT)                 /* 0x00000400 */
#define FDCAN_IE_TCFE             FDCAN_IE_TCFE_MASK                            /* Transmission Cancellation Finished Enable    */
#define FDCAN_IE_TFEE_SHIFT       (11U)
#define FDCAN_IE_TFEE_MASK        (0x1U << FDCAN_IE_TFEE_SHIFT)                 /* 0x00000800 */
#define FDCAN_IE_TFEE             FDCAN_IE_TFEE_MASK                            /* Tx FIFO Empty Enable                         */
#define FDCAN_IE_TEFNE_SHIFT      (12U)
#define FDCAN_IE_TEFNE_MASK       (0x1U << FDCAN_IE_TEFNE_SHIFT)                /* 0x00001000 */
#define FDCAN_IE_TEFNE            FDCAN_IE_TEFNE_MASK                           /* Tx Event FIFO New Entry Enable               */
#define FDCAN_IE_TEFWE_SHIFT      (13U)
#define FDCAN_IE_TEFWE_MASK       (0x1U << FDCAN_IE_TEFWE_SHIFT)                /* 0x00002000 */
#define FDCAN_IE_TEFWE            FDCAN_IE_TEFWE_MASK                           /* Tx Event FIFO Watermark Reached Enable       */
#define FDCAN_IE_TEFFE_SHIFT      (14U)
#define FDCAN_IE_TEFFE_MASK       (0x1U << FDCAN_IE_TEFFE_SHIFT)                /* 0x00004000 */
#define FDCAN_IE_TEFFE            FDCAN_IE_TEFFE_MASK                           /* Tx Event FIFO Full Enable                    */
#define FDCAN_IE_TEFLE_SHIFT      (15U)
#define FDCAN_IE_TEFLE_MASK       (0x1U << FDCAN_IE_TEFLE_SHIFT)                /* 0x00008000 */
#define FDCAN_IE_TEFLE            FDCAN_IE_TEFLE_MASK                           /* Tx Event FIFO Element Lost Enable            */
#define FDCAN_IE_TSWE_SHIFT       (16U)
#define FDCAN_IE_TSWE_MASK        (0x1U << FDCAN_IE_TSWE_SHIFT)                 /* 0x00010000 */
#define FDCAN_IE_TSWE             FDCAN_IE_TSWE_MASK                            /* Timestamp Wraparound Enable                  */
#define FDCAN_IE_MRAFE_SHIFT      (17U)
#define FDCAN_IE_MRAFE_MASK       (0x1U << FDCAN_IE_MRAFE_SHIFT)                /* 0x00020000 */
#define FDCAN_IE_MRAFE            FDCAN_IE_MRAFE_MASK                           /* Message RAM Access Failure Enable            */
#define FDCAN_IE_TOOE_SHIFT       (18U)
#define FDCAN_IE_TOOE_MASK        (0x1U << FDCAN_IE_TOOE_SHIFT)                 /* 0x00040000 */
#define FDCAN_IE_TOOE             FDCAN_IE_TOOE_MASK                            /* Timeout Occurred Enable                      */
#define FDCAN_IE_DRXE_SHIFT       (19U)
#define FDCAN_IE_DRXE_MASK        (0x1U << FDCAN_IE_DRXE_SHIFT)                 /* 0x00080000 */
#define FDCAN_IE_DRXE             FDCAN_IE_DRXE_MASK                            /* Message stored to Dedicated Rx Buffer Enable */
#define FDCAN_IE_BECE_SHIFT       (20U)
#define FDCAN_IE_BECE_MASK        (0x1U << FDCAN_IE_BECE_SHIFT)                 /* 0x00100000 */
#define FDCAN_IE_BECE             FDCAN_IE_BECE_MASK                            /* Bit Error Corrected Interrupt Enable         */
#define FDCAN_IE_BEUE_SHIFT       (21U)
#define FDCAN_IE_BEUE_MASK        (0x1U << FDCAN_IE_BEUE_SHIFT)                 /* 0x00200000 */
#define FDCAN_IE_BEUE             FDCAN_IE_BEUE_MASK                            /* Bit Error Uncorrected Interrupt Enable       */
#define FDCAN_IE_ELOE_SHIFT       (22U)
#define FDCAN_IE_ELOE_MASK        (0x1U << FDCAN_IE_ELOE_SHIFT)                 /* 0x00400000 */
#define FDCAN_IE_ELOE             FDCAN_IE_ELOE_MASK                            /* Error Logging Overflow Enable                */
#define FDCAN_IE_EPE_SHIFT        (23U)
#define FDCAN_IE_EPE_MASK         (0x1U << FDCAN_IE_EPE_SHIFT)                  /* 0x00800000 */
#define FDCAN_IE_EPE              FDCAN_IE_EPE_MASK                             /* Error Passive Enable                         */
#define FDCAN_IE_EWE_SHIFT        (24U)
#define FDCAN_IE_EWE_MASK         (0x1U << FDCAN_IE_EWE_SHIFT)                  /* 0x01000000 */
#define FDCAN_IE_EWE              FDCAN_IE_EWE_MASK                             /* Warning Status Enable                        */
#define FDCAN_IE_BOE_SHIFT        (25U)
#define FDCAN_IE_BOE_MASK         (0x1U << FDCAN_IE_BOE_SHIFT)                  /* 0x02000000 */
#define FDCAN_IE_BOE              FDCAN_IE_BOE_MASK                             /* Bus_Off Status Enable                        */
#define FDCAN_IE_WDIE_SHIFT       (26U)
#define FDCAN_IE_WDIE_MASK        (0x1U << FDCAN_IE_WDIE_SHIFT)                 /* 0x04000000 */
#define FDCAN_IE_WDIE             FDCAN_IE_WDIE_MASK                            /* Watchdog Interrupt Enable                    */
#define FDCAN_IE_PEAE_SHIFT       (27U)
#define FDCAN_IE_PEAE_MASK        (0x1U << FDCAN_IE_PEAE_SHIFT)                 /* 0x08000000 */
#define FDCAN_IE_PEAE             FDCAN_IE_PEAE_MASK                            /* Protocol Error in Arbitration Phase Enable   */
#define FDCAN_IE_PEDE_SHIFT       (28U)
#define FDCAN_IE_PEDE_MASK        (0x1U << FDCAN_IE_PEDE_SHIFT)                 /* 0x10000000 */
#define FDCAN_IE_PEDE             FDCAN_IE_PEDE_MASK                            /* Protocol Error in Data Phase Enable          */
#define FDCAN_IE_ARAE_SHIFT       (29U)
#define FDCAN_IE_ARAE_MASK        (0x1U << FDCAN_IE_ARAE_SHIFT)                 /* 0x20000000 */
#define FDCAN_IE_ARAE             FDCAN_IE_ARAE_MASK                            /* Access to Reserved Address Enable            */

/* ***************  Bit definition for FDCAN_ILS register  ******************/
#define FDCAN_ILS_RF0NL_SHIFT     (0U)
#define FDCAN_ILS_RF0NL_MASK      (0x1U << FDCAN_ILS_RF0NL_SHIFT)               /* 0x00000001 */
#define FDCAN_ILS_RF0NL           FDCAN_ILS_RF0NL_MASK                          /* Rx FIFO 0 New Message Line                  */
#define FDCAN_ILS_RF0WL_SHIFT     (1U)
#define FDCAN_ILS_RF0WL_MASK      (0x1U << FDCAN_ILS_RF0WL_SHIFT)               /* 0x00000002 */
#define FDCAN_ILS_RF0WL           FDCAN_ILS_RF0WL_MASK                          /* Rx FIFO 0 Watermark Reached Line            */
#define FDCAN_ILS_RF0FL_SHIFT     (2U)
#define FDCAN_ILS_RF0FL_MASK      (0x1U << FDCAN_ILS_RF0FL_SHIFT)               /* 0x00000004 */
#define FDCAN_ILS_RF0FL           FDCAN_ILS_RF0FL_MASK                          /* Rx FIFO 0 Full Line                         */
#define FDCAN_ILS_RF0LL_SHIFT     (3U)
#define FDCAN_ILS_RF0LL_MASK      (0x1U << FDCAN_ILS_RF0LL_SHIFT)               /* 0x00000008 */
#define FDCAN_ILS_RF0LL           FDCAN_ILS_RF0LL_MASK                          /* Rx FIFO 0 Message Lost Line                 */
#define FDCAN_ILS_RF1NL_SHIFT     (4U)
#define FDCAN_ILS_RF1NL_MASK      (0x1U << FDCAN_ILS_RF1NL_SHIFT)               /* 0x00000010 */
#define FDCAN_ILS_RF1NL           FDCAN_ILS_RF1NL_MASK                          /* Rx FIFO 1 New Message Line                  */
#define FDCAN_ILS_RF1WL_SHIFT     (5U)
#define FDCAN_ILS_RF1WL_MASK      (0x1U << FDCAN_ILS_RF1WL_SHIFT)               /* 0x00000020 */
#define FDCAN_ILS_RF1WL           FDCAN_ILS_RF1WL_MASK                          /* Rx FIFO 1 Watermark Reached Line            */
#define FDCAN_ILS_RF1FL_SHIFT     (6U)
#define FDCAN_ILS_RF1FL_MASK      (0x1U << FDCAN_ILS_RF1FL_SHIFT)               /* 0x00000040 */
#define FDCAN_ILS_RF1FL           FDCAN_ILS_RF1FL_MASK                          /* Rx FIFO 1 Full Line                         */
#define FDCAN_ILS_RF1LL_SHIFT     (7U)
#define FDCAN_ILS_RF1LL_MASK      (0x1U << FDCAN_ILS_RF1LL_SHIFT)               /* 0x00000080 */
#define FDCAN_ILS_RF1LL           FDCAN_ILS_RF1LL_MASK                          /* Rx FIFO 1 Message Lost Line                 */
#define FDCAN_ILS_HPML_SHIFT      (8U)
#define FDCAN_ILS_HPML_MASK       (0x1U << FDCAN_ILS_HPML_SHIFT)                /* 0x00000100 */
#define FDCAN_ILS_HPML            FDCAN_ILS_HPML_MASK                           /* High Priority Message Line                  */
#define FDCAN_ILS_TCL_SHIFT       (9U)
#define FDCAN_ILS_TCL_MASK        (0x1U << FDCAN_ILS_TCL_SHIFT)                 /* 0x00000200 */
#define FDCAN_ILS_TCL             FDCAN_ILS_TCL_MASK                            /* Transmission Completed Line                 */
#define FDCAN_ILS_TCFL_SHIFT      (10U)
#define FDCAN_ILS_TCFL_MASK       (0x1U << FDCAN_ILS_TCFL_SHIFT)                /* 0x00000400 */
#define FDCAN_ILS_TCFL            FDCAN_ILS_TCFL_MASK                           /* Transmission Cancellation Finished Line     */
#define FDCAN_ILS_TFEL_SHIFT      (11U)
#define FDCAN_ILS_TFEL_MASK       (0x1U << FDCAN_ILS_TFEL_SHIFT)                /* 0x00000800 */
#define FDCAN_ILS_TFEL            FDCAN_ILS_TFEL_MASK                           /* Tx FIFO Empty Line                          */
#define FDCAN_ILS_TEFNL_SHIFT     (12U)
#define FDCAN_ILS_TEFNL_MASK      (0x1U << FDCAN_ILS_TEFNL_SHIFT)               /* 0x00001000 */
#define FDCAN_ILS_TEFNL           FDCAN_ILS_TEFNL_MASK                          /* Tx Event FIFO New Entry Line                */
#define FDCAN_ILS_TEFWL_SHIFT     (13U)
#define FDCAN_ILS_TEFWL_MASK      (0x1U << FDCAN_ILS_TEFWL_SHIFT)               /* 0x00002000 */
#define FDCAN_ILS_TEFWL           FDCAN_ILS_TEFWL_MASK                          /* Tx Event FIFO Watermark Reached Line        */
#define FDCAN_ILS_TEFFL_SHIFT     (14U)
#define FDCAN_ILS_TEFFL_MASK      (0x1U << FDCAN_ILS_TEFFL_SHIFT)               /* 0x00004000 */
#define FDCAN_ILS_TEFFL           FDCAN_ILS_TEFFL_MASK                          /* Tx Event FIFO Full Line                     */
#define FDCAN_ILS_TEFLL_SHIFT     (15U)
#define FDCAN_ILS_TEFLL_MASK      (0x1U << FDCAN_ILS_TEFLL_SHIFT)               /* 0x00008000 */
#define FDCAN_ILS_TEFLL           FDCAN_ILS_TEFLL_MASK                          /* Tx Event FIFO Element Lost Line             */
#define FDCAN_ILS_TSWL_SHIFT      (16U)
#define FDCAN_ILS_TSWL_MASK       (0x1U << FDCAN_ILS_TSWL_SHIFT)                /* 0x00010000 */
#define FDCAN_ILS_TSWL            FDCAN_ILS_TSWL_MASK                           /* Timestamp Wraparound Line                   */
#define FDCAN_ILS_MRAFE_SHIFT     (17U)
#define FDCAN_ILS_MRAFE_MASK      (0x1U << FDCAN_ILS_MRAFE_SHIFT)               /* 0x00020000 */
#define FDCAN_ILS_MRAFE           FDCAN_ILS_MRAFE_MASK                          /* Message RAM Access Failure Line             */
#define FDCAN_ILS_TOOE_SHIFT      (18U)
#define FDCAN_ILS_TOOE_MASK       (0x1U << FDCAN_ILS_TOOE_SHIFT)                /* 0x00040000 */
#define FDCAN_ILS_TOOE            FDCAN_ILS_TOOE_MASK                           /* Timeout Occurred Line                       */
#define FDCAN_ILS_DRXE_SHIFT      (19U)
#define FDCAN_ILS_DRXE_MASK       (0x1U << FDCAN_ILS_DRXE_SHIFT)                /* 0x00080000 */
#define FDCAN_ILS_DRXE            FDCAN_ILS_DRXE_MASK                           /* Message stored to Dedicated Rx Buffer Line  */
#define FDCAN_ILS_BECE_SHIFT      (20U)
#define FDCAN_ILS_BECE_MASK       (0x1U << FDCAN_ILS_BECE_SHIFT)                /* 0x00100000 */
#define FDCAN_ILS_BECE            FDCAN_ILS_BECE_MASK                           /* Bit Error Corrected Interrupt Line          */
#define FDCAN_ILS_BEUE_SHIFT      (21U)
#define FDCAN_ILS_BEUE_MASK       (0x1U << FDCAN_ILS_BEUE_SHIFT)                /* 0x00200000 */
#define FDCAN_ILS_BEUE            FDCAN_ILS_BEUE_MASK                           /* Bit Error Uncorrected Interrupt Line        */
#define FDCAN_ILS_ELOE_SHIFT      (22U)
#define FDCAN_ILS_ELOE_MASK       (0x1U << FDCAN_ILS_ELOE_SHIFT)                /* 0x00400000 */
#define FDCAN_ILS_ELOE            FDCAN_ILS_ELOE_MASK                           /* Error Logging Overflow Line                 */
#define FDCAN_ILS_EPE_SHIFT       (23U)
#define FDCAN_ILS_EPE_MASK        (0x1U << FDCAN_ILS_EPE_SHIFT)                 /* 0x00800000 */
#define FDCAN_ILS_EPE             FDCAN_ILS_EPE_MASK                            /* Error Passive Line                          */
#define FDCAN_ILS_EWE_SHIFT       (24U)
#define FDCAN_ILS_EWE_MASK        (0x1U << FDCAN_ILS_EWE_SHIFT)                 /* 0x01000000 */
#define FDCAN_ILS_EWE             FDCAN_ILS_EWE_MASK                            /* Warning Status Line                         */
#define FDCAN_ILS_BOE_SHIFT       (25U)
#define FDCAN_ILS_BOE_MASK        (0x1U << FDCAN_ILS_BOE_SHIFT)                 /* 0x02000000 */
#define FDCAN_ILS_BOE             FDCAN_ILS_BOE_MASK                            /* Bus_Off Status Line                         */
#define FDCAN_ILS_WDIE_SHIFT      (26U)
#define FDCAN_ILS_WDIE_MASK       (0x1U << FDCAN_ILS_WDIE_SHIFT)                /* 0x04000000 */
#define FDCAN_ILS_WDIE            FDCAN_ILS_WDIE_MASK                           /* Watchdog Interrupt Line                     */
#define FDCAN_ILS_PEAE_SHIFT      (27U)
#define FDCAN_ILS_PEAE_MASK       (0x1U << FDCAN_ILS_PEAE_SHIFT)                /* 0x08000000 */
#define FDCAN_ILS_PEAE            FDCAN_ILS_PEAE_MASK                           /* Protocol Error in Arbitration Phase Line    */
#define FDCAN_ILS_PEDE_SHIFT      (28U)
#define FDCAN_ILS_PEDE_MASK       (0x1U << FDCAN_ILS_PEDE_SHIFT)                /* 0x10000000 */
#define FDCAN_ILS_PEDE            FDCAN_ILS_PEDE_MASK                           /* Protocol Error in Data Phase Line           */
#define FDCAN_ILS_ARAE_SHIFT      (29U)
#define FDCAN_ILS_ARAE_MASK       (0x1U << FDCAN_ILS_ARAE_SHIFT)                /* 0x20000000 */
#define FDCAN_ILS_ARAE            FDCAN_ILS_ARAE_MASK                           /* Access to Reserved Address Line             */

