kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_fdcan.h
/* ***************  Bit definition for FDCAN_ILE register  ******************/
#define FDCAN_ILE_EINT0_SHIFT       (0U)
#define FDCAN_ILE_EINT0_MASK       (0x1U << FDCAN_ILE_EINT0_SHIFT)              /* 0x00000001 */
#define FDCAN_ILE_EINT0           FDCAN_ILE_EINT0_MASK                          /* Enable Interrupt Line 0                   */
#define FDCAN_ILE_EINT1_SHIFT       (1U)
#define FDCAN_ILE_EINT1_MASK       (0x1U << FDCAN_ILE_EINT1_SHIFT)              /* 0x00000002 */
#define FDCAN_ILE_EINT1           FDCAN_ILE_EINT1_MASK                          /* Enable Interrupt Line 1                   */

/* ***************  Bit definition for FDCAN_RXGFC register  ******************/
#define FDCAN_RXGFC_RRFE_SHIFT      (0U)
#define FDCAN_RXGFC_RRFE_MASK       (0x1U << FDCAN_RXGFC_RRFE_SHIFT)                /* 0x00000001 */
#define FDCAN_RXGFC_RRFE            FDCAN_RXGFC_RRFE_MASK                           /* Reject Remote Frames Extended             */
#define FDCAN_RXGFC_RRFS_SHIFT      (1U)
#define FDCAN_RXGFC_RRFS_MASK       (0x1U << FDCAN_RXGFC_RRFS_SHIFT)                /* 0x00000002 */
#define FDCAN_RXGFC_RRFS            FDCAN_RXGFC_RRFS_MASK                           /* Reject Remote Frames Standard             */
#define FDCAN_RXGFC_ANFE_SHIFT      (2U)
#define FDCAN_RXGFC_ANFE_MASK       (0x3U << FDCAN_RXGFC_ANFE_SHIFT)                /* 0x0000000C */
#define FDCAN_RXGFC_ANFE            FDCAN_RXGFC_ANFE_MASK                           /* Accept Non-matching Frames Extended       */
#define FDCAN_RXGFC_ANFS_SHIFT      (4U)
#define FDCAN_RXGFC_ANFS_MASK       (0x3U << FDCAN_RXGFC_ANFS_SHIFT)                /* 0x00000030 */
#define FDCAN_RXGFC_ANFS            FDCAN_RXGFC_ANFS_MASK                           /* Accept Non-matching Frames Standard       */
#define FDCAN_RXGFC_F1OM_SHIFT      (8U)
#define FDCAN_RXGFC_F1OM_MASK       (1U << FDCAN_RXGFC_F1OM_SHIFT)                  /* 0x00000100 */
#define FDCAN_RXGFC_F1OM            FDCAN_RXGFC_F1OM_MASK                           /* FIFO 1 Operation Mode */
#define FDCAN_RXGFC_F0OM_SHIFT      (9U)
#define FDCAN_RXGFC_F0OM_MASK       (1U << FDCAN_RXGFC_F0OM_SHIFT)                  /* 0x00000200 */
#define FDCAN_RXGFC_F0OM            FDCAN_RXGFC_F0OM_MASK                           /* FIFO 0 Operation Mode */
#define FDCAN_RXGFS_LSS_SHIFT       (16U)
#define FDCAN_RXGFS_LSS_MASK        (0x1fu << FDCAN_RXGFC_LSS_SHIFT)                /* 0x001f0000 */
#define FDCAN_RXGFS_LSS             FDCAN_RXGFS_LSS_MASK                            /* Number of standard filter elements in list */ 
#define FDCAN_RXGFS_LSE_SHIFT       (24U)
#define FDCAN_RXGFS_LSE_MASK        (0xfu << FDCAN_RXGFC_LSE_SHIFT)                 /* 0x0f000000 */
#define FDCAN_RXGFS_LSE             FDCAN_RXGFS_LSE_MASK                            /* Number of extended filter elements in list */ 

/* ***************  Bit definition for FDCAN_XIDAM register  ****************/
#define FDCAN_XIDAM_EIDM_SHIFT    (0U)
#define FDCAN_XIDAM_EIDM_MASK     (0x1FFFFFFFU << FDCAN_XIDAM_EIDM_SHIFT)       /* 0x1FFFFFFF */
#define FDCAN_XIDAM_EIDM          FDCAN_XIDAM_EIDM_MASK                         /* Extended ID Mask                          */

/* ***************  Bit definition for FDCAN_HPMS register  *****************/
#define FDCAN_HPMS_BIDX_SHIFT     (0U)
#define FDCAN_HPMS_BIDX_MASK      (0x3FU << FDCAN_HPMS_BIDX_SHIFT)              /* 0x0000003F */
#define FDCAN_HPMS_BIDX           FDCAN_HPMS_BIDX_MASK                          /* Buffer Index                              */
#define FDCAN_HPMS_MSI_SHIFT      (6U)
#define FDCAN_HPMS_MSI_MASK       (0x3U << FDCAN_HPMS_MSI_SHIFT)                /* 0x000000C0 */
#define FDCAN_HPMS_MSI            FDCAN_HPMS_MSI_MASK                           /* Message Storage Indicator                 */
#define FDCAN_HPMS_FIDX_SHIFT     (8U)
#define FDCAN_HPMS_FIDX_MASK      (0x7FU << FDCAN_HPMS_FIDX_SHIFT)              /* 0x00007F00 */
#define FDCAN_HPMS_FIDX           FDCAN_HPMS_FIDX_MASK                          /* Filter Index                              */
#define FDCAN_HPMS_FLST_SHIFT     (15U)
#define FDCAN_HPMS_FLST_MASK      (0x1U << FDCAN_HPMS_FLST_SHIFT)               /* 0x00008000 */
#define FDCAN_HPMS_FLST           FDCAN_HPMS_FLST_MASK                          /* Filter List                               */



/* ***************  Bit definition for FDCAN_RXF0S register  ****************/
#define FDCAN_RXF0S_F0FL_SHIFT    (0U)
#define FDCAN_RXF0S_F0FL_MASK     (0x7FU << FDCAN_RXF0S_F0FL_SHIFT)             /* 0x0000007F */
#define FDCAN_RXF0S_F0FL          FDCAN_RXF0S_F0FL_MASK                         /* Rx FIFO 0 Fill Level                      */
#define FDCAN_RXF0S_F0GI_SHIFT    (8U)
#define FDCAN_RXF0S_F0GI_MASK     (0x3FU << FDCAN_RXF0S_F0GI_SHIFT)             /* 0x00003F00 */
#define FDCAN_RXF0S_F0GI          FDCAN_RXF0S_F0GI_MASK                         /* Rx FIFO 0 Get Index                       */
#define FDCAN_RXF0S_F0PI_SHIFT    (16U)
#define FDCAN_RXF0S_F0PI_MASK     (0x3FU << FDCAN_RXF0S_F0PI_SHIFT)             /* 0x003F0000 */
#define FDCAN_RXF0S_F0PI          FDCAN_RXF0S_F0PI_MASK                         /* Rx FIFO 0 Put Index                       */
#define FDCAN_RXF0S_F0F_SHIFT     (24U)
#define FDCAN_RXF0S_F0F_MASK      (0x1U << FDCAN_RXF0S_F0F_SHIFT)               /* 0x01000000 */
#define FDCAN_RXF0S_F0F           FDCAN_RXF0S_F0F_MASK                          /* Rx FIFO 0 Full                            */
#define FDCAN_RXF0S_RF0L_SHIFT    (25U)
#define FDCAN_RXF0S_RF0L_MASK     (0x1U << FDCAN_RXF0S_RF0L_SHIFT)              /* 0x02000000 */
#define FDCAN_RXF0S_RF0L          FDCAN_RXF0S_RF0L_MASK                         /* Rx FIFO 0 Message Lost                    */

/* ***************  Bit definition for FDCAN_RXF0A register  ****************/
#define FDCAN_RXF0A_F0AI_SHIFT    (0U)
#define FDCAN_RXF0A_F0AI_MASK     (0x3FU << FDCAN_RXF0A_F0AI_SHIFT)             /* 0x0000003F */
#define FDCAN_RXF0A_F0AI          FDCAN_RXF0A_F0AI_MASK                         /* Rx FIFO 0 Acknowledge Index               */


/* ***************  Bit definition for FDCAN_RXF1S register  ****************/
#define FDCAN_RXF1S_F1FL_SHIFT    (0U)
#define FDCAN_RXF1S_F1FL_MASK     (0x7FU << FDCAN_RXF1S_F1FL_SHIFT)             /* 0x0000007F */
#define FDCAN_RXF1S_F1FL          FDCAN_RXF1S_F1FL_MASK                         /* Rx FIFO 1 Fill Level                      */
#define FDCAN_RXF1S_F1GI_SHIFT    (8U)
#define FDCAN_RXF1S_F1GI_MASK     (0x3FU << FDCAN_RXF1S_F1GI_SHIFT)             /* 0x00003F00 */
#define FDCAN_RXF1S_F1GI          FDCAN_RXF1S_F1GI_MASK                         /* Rx FIFO 1 Get Index                       */
#define FDCAN_RXF1S_F1PI_SHIFT    (16U)
#define FDCAN_RXF1S_F1PI_MASK     (0x3FU << FDCAN_RXF1S_F1PI_SHIFT)             /* 0x003F0000 */
#define FDCAN_RXF1S_F1PI          FDCAN_RXF1S_F1PI_MASK                         /* Rx FIFO 1 Put Index                       */
#define FDCAN_RXF1S_F1F_SHIFT     (24U)
#define FDCAN_RXF1S_F1F_MASK      (0x1U << FDCAN_RXF1S_F1F_SHIFT)               /* 0x01000000 */
#define FDCAN_RXF1S_F1F           FDCAN_RXF1S_F1F_MASK                          /* Rx FIFO 1 Full                            */
#define FDCAN_RXF1S_RF1L_SHIFT    (25U)
#define FDCAN_RXF1S_RF1L_MASK     (0x1U << FDCAN_RXF1S_RF1L_SHIFT)              /* 0x02000000 */
#define FDCAN_RXF1S_RF1L          FDCAN_RXF1S_RF1L_MASK                         /* Rx FIFO 1 Message Lost                    */

