kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_fdcan.h
/* ***************  Bit definition for FDCAN_RXF1A register  ****************/
#define FDCAN_RXF1A_F1AI_SHIFT    (0U)
#define FDCAN_RXF1A_F1AI_MASK     (0x3FU << FDCAN_RXF1A_F1AI_SHIFT)             /* 0x0000003F */
#define FDCAN_RXF1A_F1AI          FDCAN_RXF1A_F1AI_MASK                         /* Rx FIFO 1 Acknowledge Index               */


/* ***************  Bit definition for FDCAN_TXBC register  *****************/
#define FDCAN_TXBC_TBSA_SHIFT     (2U)
#define FDCAN_TXBC_TBSA_MASK      (0x3FFFU << FDCAN_TXBC_TBSA_SHIFT)            /* 0x0000FFFC */
#define FDCAN_TXBC_TBSA           FDCAN_TXBC_TBSA_MASK                          /* Tx Buffers Start Address                  */
#define FDCAN_TXBC_NDTB_SHIFT     (16U)
#define FDCAN_TXBC_NDTB_MASK      (0x3FU << FDCAN_TXBC_NDTB_SHIFT)              /* 0x003F0000 */
#define FDCAN_TXBC_NDTB           FDCAN_TXBC_NDTB_MASK                          /* Number of Dedicated Transmit Buffers      */
#define FDCAN_TXBC_TFQS_SHIFT     (24U)
#define FDCAN_TXBC_TFQS_MASK      (0x3FU << FDCAN_TXBC_TFQS_SHIFT)              /* 0x3F000000 */
#define FDCAN_TXBC_TFQS           FDCAN_TXBC_TFQS_MASK                          /* Transmit FIFO/Queue Size                  */
#define FDCAN_TXBC_TFQM_SHIFT     (30U)
#define FDCAN_TXBC_TFQM_MASK      (0x1U << FDCAN_TXBC_TFQM_SHIFT)               /* 0x40000000 */
#define FDCAN_TXBC_TFQM           FDCAN_TXBC_TFQM_MASK                          /* Tx FIFO/Queue Mode                        */

/* ***************  Bit definition for FDCAN_TXFQS register  ****************/
#define FDCAN_TXFQS_TFFL_SHIFT    (0U)
#define FDCAN_TXFQS_TFFL_MASK     (0x3FU << FDCAN_TXFQS_TFFL_SHIFT)             /* 0x0000003F */
#define FDCAN_TXFQS_TFFL          FDCAN_TXFQS_TFFL_MASK                         /* Tx FIFO Free Level                        */
#define FDCAN_TXFQS_TFGI_SHIFT    (8U)
#define FDCAN_TXFQS_TFGI_MASK     (0x1FU << FDCAN_TXFQS_TFGI_SHIFT)             /* 0x00001F00 */
#define FDCAN_TXFQS_TFGI          FDCAN_TXFQS_TFGI_MASK                         /* Tx FIFO Get Index                         */
#define FDCAN_TXFQS_TFQPI_SHIFT   (16U)
#define FDCAN_TXFQS_TFQPI_MASK    (0x1FU << FDCAN_TXFQS_TFQPI_SHIFT)            /* 0x001F0000 */
#define FDCAN_TXFQS_TFQPI         FDCAN_TXFQS_TFQPI_MASK                        /* Tx FIFO/Queue Put Index                   */
#define FDCAN_TXFQS_TFQF_SHIFT    (21U)
#define FDCAN_TXFQS_TFQF_MASK     (0x1U << FDCAN_TXFQS_TFQF_SHIFT)              /* 0x00200000 */
#define FDCAN_TXFQS_TFQF          FDCAN_TXFQS_TFQF_MASK                         /* Tx FIFO/Queue Full                        */

/* ***************  Bit definition for FDCAN_TXBRP register  ****************/
#define FDCAN_TXBRP_TRP_SHIFT     (0U)
#define FDCAN_TXBRP_TRP_MASK      (0xFFFFFFFFU << FDCAN_TXBRP_TRP_SHIFT)        /* 0xFFFFFFFF */
#define FDCAN_TXBRP_TRP           FDCAN_TXBRP_TRP_MASK                          /* Transmission Request Pending              */

/* ***************  Bit definition for FDCAN_TXBAR register  ****************/
#define FDCAN_TXBAR_AR_SHIFT      (0U)
#define FDCAN_TXBAR_AR_MASK       (0xFFFFFFFFU << FDCAN_TXBAR_AR_SHIFT)         /* 0xFFFFFFFF */
#define FDCAN_TXBAR_AR            FDCAN_TXBAR_AR_MASK                           /* Add Request                               */

/* ***************  Bit definition for FDCAN_TXBCR register  ****************/
#define FDCAN_TXBCR_CR_SHIFT      (0U)
#define FDCAN_TXBCR_CR_MASK       (0xFFFFFFFFU << FDCAN_TXBCR_CR_SHIFT)         /* 0xFFFFFFFF */
#define FDCAN_TXBCR_CR            FDCAN_TXBCR_CR_MASK                           /* Cancellation Request                      */

/* ***************  Bit definition for FDCAN_TXBTO register  ****************/
#define FDCAN_TXBTO_TO_SHIFT      (0U)
#define FDCAN_TXBTO_TO_MASK       (0xFFFFFFFFU << FDCAN_TXBTO_TO_SHIFT)         /* 0xFFFFFFFF */
#define FDCAN_TXBTO_TO            FDCAN_TXBTO_TO_MASK                           /* Transmission Occurred                     */

/* ***************  Bit definition for FDCAN_TXBCF register  ****************/
#define FDCAN_TXBCF_CF_SHIFT      (0U)
#define FDCAN_TXBCF_CF_MASK       (0xFFFFFFFFU << FDCAN_TXBCF_CF_SHIFT)         /* 0xFFFFFFFF */
#define FDCAN_TXBCF_CF            FDCAN_TXBCF_CF_MASK                           /* Cancellation Finished                     */

/* ***************  Bit definition for FDCAN_TXBTIE register  ***************/
#define FDCAN_TXBTIE_TIE_SHIFT    (0U)
#define FDCAN_TXBTIE_TIE_MASK     (0xFFFFFFFFU << FDCAN_TXBTIE_TIE_SHIFT)       /* 0xFFFFFFFF */
#define FDCAN_TXBTIE_TIE          FDCAN_TXBTIE_TIE_MASK                         /* Transmission Interrupt Enable             */

/* ***************  Bit definition for FDCAN_ TXBCIE register  **************/
#define FDCAN_TXBCIE_CF_SHIFT     (0U)
#define FDCAN_TXBCIE_CF_MASK      (0xFFFFFFFFU << FDCAN_TXBCIE_CF_SHIFT)        /* 0xFFFFFFFF */
#define FDCAN_TXBCIE_CF           FDCAN_TXBCIE_CF_MASK                          /* Cancellation Finished Interrupt Enable    */

/* ***************  Bit definition for FDCAN_TXEFS register  ****************/
#define FDCAN_TXEFS_EFFL_SHIFT    (0U)
#define FDCAN_TXEFS_EFFL_MASK     (0x3FU << FDCAN_TXEFS_EFFL_SHIFT)             /* 0x0000003F */
#define FDCAN_TXEFS_EFFL          FDCAN_TXEFS_EFFL_MASK                         /* Event FIFO Fill Level                     */
#define FDCAN_TXEFS_EFGI_SHIFT    (8U)
#define FDCAN_TXEFS_EFGI_MASK     (0x1FU << FDCAN_TXEFS_EFGI_SHIFT)             /* 0x00001F00 */
#define FDCAN_TXEFS_EFGI          FDCAN_TXEFS_EFGI_MASK                         /* Event FIFO Get Index                      */
#define FDCAN_TXEFS_EFPI_SHIFT    (16U)
#define FDCAN_TXEFS_EFPI_MASK     (0x1FU << FDCAN_TXEFS_EFPI_SHIFT)             /* 0x001F0000 */
#define FDCAN_TXEFS_EFPI          FDCAN_TXEFS_EFPI_MASK                         /* Event FIFO Put Index                      */
#define FDCAN_TXEFS_EFF_SHIFT     (24U)
#define FDCAN_TXEFS_EFF_MASK      (0x1U << FDCAN_TXEFS_EFF_SHIFT)               /* 0x01000000 */
#define FDCAN_TXEFS_EFF           FDCAN_TXEFS_EFF_MASK                          /* Event FIFO Full                           */
#define FDCAN_TXEFS_TEFL_SHIFT    (25U)
#define FDCAN_TXEFS_TEFL_MASK     (0x1U << FDCAN_TXEFS_TEFL_SHIFT)              /* 0x02000000 */
#define FDCAN_TXEFS_TEFL          FDCAN_TXEFS_TEFL_MASK                         /* Tx Event FIFO Element Lost                */

/* ***************  Bit definition for FDCAN_TXEFA register  ****************/
#define FDCAN_TXEFA_EFAI_SHIFT    (0U)
#define FDCAN_TXEFA_EFAI_MASK     (0x1FU << FDCAN_TXEFA_EFAI_SHIFT)             /* 0x0000001F */
#define FDCAN_TXEFA_EFAI          FDCAN_TXEFA_EFAI_MASK                         /* Event FIFO Acknowledge Index              */

/* ***************  Bit definition for FDCAN_CKDIV register  ****************/
#define FDCAN_CKDIV_PDIV_SHIFT    (0U)
#define FDCAN_CKDIV_PDIV_MASK     (0xFU << FDCAN_CKDIV_PDIV_SHIFT)              /* 0x0000000F */
#define FDCAN_CKDIV_PDIV          FDCAN_CKDIV_PDIV_MASK                         /* Input Clock Divider */


#endif /* __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32_FDCAN_H */
